{
  "backend/main.mo": "Defines a canister with an internal secret and an authenticateSecretToken method that traps if the provided token does not match.",
  "backend/migration.mo": "Migration module converting an old actor’s serverPasscode field into the new internalSecret field.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-written summaries of various frontend files describing their purpose and behavior.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining how to run, deploy, and configure link‑only access using a backend secret token.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining the romantic theme and global styling.",
  "frontend/index.html": "HTML entry point loading the React app with Valentine-themed metadata.",
  "frontend/src/App.tsx": "Root component that enforces secret‑token authorization and drives the prank → transition → proposal → victory scene flow.",
  "frontend/src/components/valentine/AccessGateScreen.tsx": "Empty placeholder file for the former passcode gate UI.",
  "frontend/src/components/valentine/ConfettiBurst.tsx": "Canvas‑based confetti burst animation that runs for about three seconds.",
  "frontend/src/components/valentine/CrackingHeart.tsx": "Animated SVG heart that progressively reveals crack lines over time.",
  "frontend/src/components/valentine/EvasiveNoButton.tsx": "NO button that dodges user interaction with random movement, scaling, shake animation, and denial popup behavior.",
  "frontend/src/components/valentine/GlitchFixTransition.tsx": "Displays a glitchy 404 screen with shake and flash animations.",
  "frontend/src/components/valentine/HeartParticles.tsx": "Generates floating heart particles with randomized positions and animation timings.",
  "frontend/src/components/valentine/HeartRain.tsx": "Creates falling heart animations with randomized sizes and timing.",
  "frontend/src/components/valentine/InvalidLinkScreen.tsx": "Shows an animated decorative invalid‑link error card with floating hearts.",
  "frontend/src/components/valentine/MusicToggle.tsx": "Provides a button to play or pause background music using an Audio element.",
  "frontend/src/components/valentine/scenes/Prank404Scene.tsx": "A themed 404 scene with glitch text, particles, and a cracking heart graphic.",
  "frontend/src/components/valentine/scenes/ProposalScene.tsx": "Valentine proposal screen featuring a yes button handler and evasive no button.",
  "frontend/src/components/valentine/scenes/VictoryScene.tsx": "Victory screen with confetti, heart rain, and a customizable romantic message.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, and identity persistence.",
  "frontend/src/hooks/usePasscodeGate.ts": "Empty placeholder file for a passcode gate hook.",
  "frontend/src/hooks/useSecretTokenGate.ts": "Validates a URL token via backend and tracks authorization state in sessionStorage.",
  "frontend/src/index.css": "Global styles including Tailwind setup, romantic color variables, and animations.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom color variables, typography/container/animation plugins, and extended fonts, radii, and shadows.",
  "project_state.json": "Defines project metadata for a single‑page Valentine’s prank site including scenes, animations, link‑only access, and known issues requiring fixes."
}