{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report mapping high-level feature requirements to involved frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the Valentine app.",
  "frontend/DEPLOYMENT.md": "Guide for local development and Internet Computer deployment with customization notes.",
  "frontend/index.css": "Tailwind base styles and OKLCH-themed romantic color variables with animation utilities.",
  "frontend/index.html": "HTML entry point setting up metadata and loading the React app.",
  "frontend/src/App.tsx": "Main React component managing scene transitions and user interactions for prank, transition, proposal, and victory states.",
  "frontend/src/components/valentine/ConfettiBurst.tsx": "Canvas-based confetti explosion animation triggered during the victory scene.",
  "frontend/src/components/valentine/CrackingHeart.tsx": "Animated SVG heart that progressively cracks using timed stroke-dashoffset changes.",
  "frontend/src/components/valentine/EvasiveNoButton.tsx": "Interactive NO button that dodges user attempts with random movement and escalating reactions.",
  "frontend/src/components/valentine/GlitchFixTransition.tsx": "Glitchy transition screen used between the 404 prank scene and the proposal scene.",
  "frontend/src/components/valentine/HeartParticles.tsx": "Floating heart particle elements creating a subtle upward drifting background effect.",
  "frontend/src/components/valentine/HeartRain.tsx": "Falling heart animation used as a celebratory effect in the victory scene.",
  "frontend/src/components/valentine/MusicToggle.tsx": "A button that toggles background music playback using an Audio element and displays volume icons.",
  "frontend/src/components/valentine/scenes/Prank404Scene.tsx": "Renders the glitchy 404 prank screen with heart particles, a cracking heart, and themed text.",
  "frontend/src/components/valentine/scenes/ProposalScene.tsx": "Shows the proposal scene with a romantic heading, a YES button callback, and an evasive NO button.",
  "frontend/src/components/valentine/scenes/VictoryScene.tsx": "Displays the celebratory victory screen with confetti, falling hearts, a customizable message, and an image.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity login, identity loading, and status management.",
  "frontend/src/index.css": "Global Tailwind-based styles defining fonts, theme variables, animations, and romantic visual effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom romantic colors, fonts, utilities, and plugins.",
  "project_state.json": "Stores project metadata, feature definitions, requirements, and state for the Valentine’s prank site."
}