{
  "kind": "build_request",
  "title": "Replace passcode gate with link-only access (URL token) and remove password UI",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Remove the passcode/password access flow so the Valentine app no longer prompts for a passcode and no longer calls the backend `authenticatePasscode` method to unlock the site.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make it link only access and remove the password its not working"
        ]
      },
      "acceptanceCriteria": [
        "When visiting the site, the passcode entry screen is never shown.",
        "The frontend no longer imports/uses `AccessGateScreen` or `usePasscodeGate` to gate rendering of the scenes.",
        "The backend no longer exposes an `authenticatePasscode` API intended for passcode entry (or it is unused and removed as part of this change).",
        "The project builds and runs without TypeScript or Motoko compilation errors after removal."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Implement link-only access by requiring a secret token embedded in the URL (e.g., a query parameter) and validate that token via the backend before rendering any prank/proposal/victory scenes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make it link only access"
        ]
      },
      "acceptanceCriteria": [
        "If the required token is missing or invalid, none of the prank/proposal/victory scenes are rendered.",
        "If the token is valid, the existing single-page scene flow works exactly as before (404 prank → transition → proposal → victory).",
        "Token validation is performed against a backend-stored secret (not hardcoded only in frontend).",
        "A user can access the app by opening the exact link containing the correct token, with no additional passcode prompt."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add a clear, minimal “invalid link” blocked-access UI state for cases where the URL token is missing/incorrect, using English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make it link only access"
        ]
      },
      "acceptanceCriteria": [
        "When access is blocked, the UI shows a single blocking screen/state with English text indicating the link is invalid or incomplete.",
        "The blocked-access UI does not expose the secret token value.",
        "The blocked-access UI works on mobile and desktop and prevents interaction with the underlying scenes."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Update `frontend/DEPLOYMENT.md` to remove passcode setup instructions and replace them with link-only access instructions: how to set/change the backend secret token and how to form the correct shareable URL containing the token, including clear limitations (anyone with the link can access).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove the password"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/DEPLOYMENT.md` no longer instructs users to configure or enter a passcode.",
        "Documentation explains how to set/change the link token in the backend and redeploy.",
        "Documentation includes an example of a shareable URL format that includes the token (example text in English).",
        "Documentation includes a limitation note that link-only access is not share-proof: anyone with the link can access."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/components/ui` or other immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Do not introduce third-party auth providers; only existing Internet Computer deployment model is allowed."
  ],
  "nonGoals": [
    "Providing strong, user-specific authentication/authorization (link-only access is inherently shareable).",
    "Adding routing/navigation beyond the existing single-page scene flow.",
    "Implementing real-time or database-backed access logs/auditing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}