{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace passcode gate with URL token link-only access (frontend)",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Remove the passcode/password access UI and frontend passcode gating logic so the app never prompts for a passcode and no longer calls the passcode auth backend method.",
      "acceptanceCriteria": [
        "When visiting the site, the passcode entry screen is never shown.",
        "The frontend no longer imports/uses `AccessGateScreen` or `usePasscodeGate` to gate rendering of the scenes.",
        "The project builds and runs without TypeScript compilation errors after removal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove all passcode-gate imports/usage (`AccessGateScreen`, `usePasscodeGate`, and any `verifyPasscode` flow) and replace the initial gating decision with the new link-token authorization state (implemented in REQ-22/REQ-23)."
        },
        {
          "path": "frontend/src/hooks/usePasscodeGate.ts",
          "operation": "delete",
          "description": "Delete the passcode-gating hook so the frontend no longer calls the backend passcode authentication method."
        },
        {
          "path": "frontend/src/components/valentine/AccessGateScreen.tsx",
          "operation": "delete",
          "description": "Delete the passcode entry screen UI so the app no longer renders a password/passcode prompt."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Require a secret token in the URL and validate it (via existing backend actor method) before rendering any prank/proposal/victory scenes, while preserving the existing single-page scene flow.",
      "acceptanceCriteria": [
        "If the required token is missing or invalid, none of the prank/proposal/victory scenes are rendered.",
        "If the token is valid, the existing single-page scene flow works exactly as before (404 prank → transition → proposal → victory).",
        "A user can access the app by opening the exact link containing the correct token, with no additional passcode prompt."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSecretTokenGate.ts",
          "operation": "create",
          "description": "Create a hook that (1) reads the secret token from the URL query string, (2) calls the backend actor capability `authenticateSecretToken` to validate it, and (3) exposes an authorization state (authorized / checking / blocked) for App-level gating. Use `useActor` for actor access and avoid hardcoding the secret in the frontend. Persist only a boolean authorization flag if needed (do not store/expose the token)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new `useSecretTokenGate` hook into the top-level rendering flow: block all prank/transition/proposal/victory scene rendering until the token has been validated, and only run the existing scene state machine after authorization is confirmed. Ensure the flow remains single-page with no new navigation added."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add a minimal, blocking “invalid link” UI state shown when the URL token is missing or invalid, preventing interaction with underlying scenes.",
      "acceptanceCriteria": [
        "When access is blocked, the UI shows a single blocking screen/state with English text indicating the link is invalid or incomplete.",
        "The blocked-access UI does not expose the secret token value.",
        "The blocked-access UI works on mobile and desktop and prevents interaction with the underlying scenes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/valentine/InvalidLinkScreen.tsx",
          "operation": "create",
          "description": "Add a simple full-screen blocked-access component that displays English text for missing/invalid link access (no token echoing), sized responsively for mobile/desktop. If using any shadcn-ui primitives, verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render `InvalidLinkScreen` whenever the token gate state is blocked (missing/invalid token), and ensure the underlying scenes are not mounted/rendered in this state (so the blocked screen fully prevents interaction)."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update deployment documentation to remove passcode instructions and document link-only token access: how to set/change the backend secret token and how to form the shareable URL, including limitations.",
      "acceptanceCriteria": [
        "`frontend/DEPLOYMENT.md` no longer instructs users to configure or enter a passcode.",
        "Documentation explains how to set/change the link token in the backend and redeploy.",
        "Documentation includes an example of a shareable URL format that includes the token (example text in English).",
        "Documentation includes a limitation note that link-only access is not share-proof: anyone with the link can access."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Replace the passcode-gate section with link-only access documentation: describe where to set/change the backend secret token (in backend code), redeploy steps, an example shareable URL format that includes the token as a query parameter, and an explicit limitation note that anyone with the link can access."
        }
      ]
    }
  ]
}